/* 
Составить программу, которая в зависимости от 
порядкового номера дня недели (1, 2, …, 7) выводит на экран его название (понедельник, вторник, …, воскресенье)
*/


#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}

